# Análisis de datos con Pandas

Pandas es un paquete de Python que facilita el análisis de datos, proporcionando estructuras de datos rápidas, flexibles y expresivas que hacen el trabajo mucho más intuitivo.

## Importando los paquetes necesarios

In [1]:
import pandas as pd 
import numpy as np  #Paquete de cálculo científico y análisis de datos

## Creación de variables
Primero creamos las variables a analizar.

In [3]:
Vendedor=np.array(["María","Juana","Maria","Jose","Maria","Juana","Maria","Jose","Maria","Juana"])
Venta=np.array([3000,4000,5000,2000,6000,7000,10000,7000,3000,6000])
Descuento=np.array([0.10,0.20,0.5,0.6,0.8,np.nan,0.3,0.2,0.1,0.10])
Comision=np.array([0.01,0.02,0.01,0.04,0.01,0.02,0.03,0.00,0.05,0.01])
Horario=["Nocturno"]*6 + ["Diurno"]*4

## Dataframe
Un dataframe es un tipo especial de objeto de python cuya estructura permite almacenar un conjunto de datos. Los datos almacenados pueden ser de diversos tipos tanto numéricos y alfanuméricos. Su representación es muy similar a la de una matriz, en donde, las filas van a representar a los individuos y las columnas a las variables.

In [4]:
df=pd.DataFrame({"Vendedor":Vendedor,"Venta":Venta,"Descuento":Descuento,"Comision":Comision,"Horario":Horario})
df

  Vendedor  Venta  Descuento  Comision   Horario
0    María   3000        0.1      0.01  Nocturno
1    Juana   4000        0.2      0.02  Nocturno
2    Maria   5000        0.5      0.01  Nocturno
3     Jose   2000        0.6      0.04  Nocturno
4    Maria   6000        0.8      0.01  Nocturno
5    Juana   7000        NaN      0.02  Nocturno
6    Maria  10000        0.3      0.03    Diurno
7     Jose   7000        0.2      0.00    Diurno
8    Maria   3000        0.1      0.05    Diurno
9    Juana   6000        0.1      0.01    Diurno

### Manipulación del dataframe

#### Agregar datos

Agregar el dato:

Jose    "8000"  "0.20"    "0.01"    "Nocturno"

In [5]:
df.loc[len(df)]=["Jose",5000,0.20,0.01,"Nocturno"] 
df

   Vendedor  Venta  Descuento  Comision   Horario
0     María   3000        0.1      0.01  Nocturno
1     Juana   4000        0.2      0.02  Nocturno
2     Maria   5000        0.5      0.01  Nocturno
3      Jose   2000        0.6      0.04  Nocturno
4     Maria   6000        0.8      0.01  Nocturno
5     Juana   7000        NaN      0.02  Nocturno
6     Maria  10000        0.3      0.03    Diurno
7      Jose   7000        0.2      0.00    Diurno
8     Maria   3000        0.1      0.05    Diurno
9     Juana   6000        0.1      0.01    Diurno
10     Jose   5000        0.2      0.01  Nocturno

#### Seleccionar los primeros cinco individuos

In [6]:
df_individuos = df[:5]
df_individuos

  Vendedor  Venta  Descuento  Comision   Horario
0    María   3000        0.1      0.01  Nocturno
1    Juana   4000        0.2      0.02  Nocturno
2    Maria   5000        0.5      0.01  Nocturno
3     Jose   2000        0.6      0.04  Nocturno
4    Maria   6000        0.8      0.01  Nocturno

#### Seleccionar el quinto y séptimo individuo

In [7]:
df_individuos = df.loc[np.array([4,6])]
df_individuos

  Vendedor  Venta  Descuento  Comision   Horario
4    Maria   6000        0.8      0.01  Nocturno
6    Maria  10000        0.3      0.03    Diurno

#### Seleccionar las variables Vendedor y Venta

In [8]:
df_Variables = df[["Vendedor","Venta"]]
df_Variables

   Vendedor  Venta
0     María   3000
1     Juana   4000
2     Maria   5000
3      Jose   2000
4     Maria   6000
5     Juana   7000
6     Maria  10000
7      Jose   7000
8     Maria   3000
9     Juana   6000
10     Jose   5000

#### Filtrar los datos por algún valor

Seleccionar las ventas de María

In [9]:
df_Maria = df[df["Vendedor"]=="María"]
df_Maria

  Vendedor  Venta  Descuento  Comision   Horario
0    María   3000        0.1      0.01  Nocturno

Seleccionar las ventas con comisión igual al 0.01

In [10]:
df_comision = df[df["Comision"].isin([0.01])]
df_comision

   Vendedor  Venta  Descuento  Comision   Horario
0     María   3000        0.1      0.01  Nocturno
2     Maria   5000        0.5      0.01  Nocturno
4     Maria   6000        0.8      0.01  Nocturno
9     Juana   6000        0.1      0.01    Diurno
10     Jose   5000        0.2      0.01  Nocturno

Seleccionar las ventas con descuento mayor al 20%

In [11]:
df_descuento = df[df["Descuento"]>0.2]
df_descuento

  Vendedor  Venta  Descuento  Comision   Horario
2    Maria   5000        0.5      0.01  Nocturno
3     Jose   2000        0.6      0.04  Nocturno
4    Maria   6000        0.8      0.01  Nocturno
6    Maria  10000        0.3      0.03    Diurno

Eliminar filas si alguna tiene un valor perdido

In [12]:
df.dropna()

   Vendedor  Venta  Descuento  Comision   Horario
0     María   3000        0.1      0.01  Nocturno
1     Juana   4000        0.2      0.02  Nocturno
2     Maria   5000        0.5      0.01  Nocturno
3      Jose   2000        0.6      0.04  Nocturno
4     Maria   6000        0.8      0.01  Nocturno
6     Maria  10000        0.3      0.03    Diurno
7      Jose   7000        0.2      0.00    Diurno
8     Maria   3000        0.1      0.05    Diurno
9     Juana   6000        0.1      0.01    Diurno
10     Jose   5000        0.2      0.01  Nocturno

### Guardar y cargar un dataframe

Guardar el dataframe como un archivo pickled

In [13]:
df.to_pickle("Ventas Diarias.plk") # guarda como un archivo .plk

Cargar el archivo pickled

In [14]:
DataFrame= pd.read_pickle("Ventas Diarias.plk")
DataFrame

   Vendedor  Venta  Descuento  Comision   Horario
0     María   3000        0.1      0.01  Nocturno
1     Juana   4000        0.2      0.02  Nocturno
2     Maria   5000        0.5      0.01  Nocturno
3      Jose   2000        0.6      0.04  Nocturno
4     Maria   6000        0.8      0.01  Nocturno
5     Juana   7000        NaN      0.02  Nocturno
6     Maria  10000        0.3      0.03    Diurno
7      Jose   7000        0.2      0.00    Diurno
8     Maria   3000        0.1      0.05    Diurno
9     Juana   6000        0.1      0.01    Diurno
10     Jose   5000        0.2      0.01  Nocturno

### Exportar archivos

In [15]:
df.to_csv("Ventas.csv",header=True,sep=";")

### Importar archivos

In [16]:
#pd.read_csv("Ventas.csv",sep="\t")
datos=pd.read_excel('VentasXls.xlsx', sheetname='VentasXls')
datos

C:\Users\diant\Anaconda3\lib\site-packages\pandas\util\_decorators.py:188: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

FileNotFoundError: [Errno 2] No such file or directory: 'VentasXls.xlsx'

## Taller

Cree un dataframe con el nombre df1 con los siguientes datos:

Jose     "6000"  "0.20"    "0.01"    "Nocturno"\
Maria    "6500"  "0.10"    "0.02"    "Diurno"\
Juana    "4000"  "0.30"    "0.03"    "Diurno"\
Jose     "2000"  "0.10"    "0.02"    "Diurno"\
Juana    "1500"  "0.30"    "0.03"    "Diurno"

Una estos datos al anterior dataframe utilizando el comando

df.append(df1, ignore_index = True)

## Cálculo de las principales medidas estadísticas

### Variables numéricas

Medidas de tendencia central: Media.

Medidas de dispersión: Desviación estándar y cuartiles

In [197]:
df.describe() #Medidas básicas

              Venta  Descuento   Comision
count     10.000000   9.000000  10.000000
mean    5300.000000   0.322222   0.020000
std     2406.010991   0.253859   0.015635
min     2000.000000   0.100000   0.000000
25%     3250.000000   0.100000   0.010000
50%     5500.000000   0.200000   0.015000
75%     6750.000000   0.500000   0.027500
max    10000.000000   0.800000   0.050000

In [10]:
df.median() # Mediana

Venta        5500.000
Descuento       0.200
Comision        0.015
dtype: float64

In [11]:
df.mode() # Moda

  Vendedor  Venta  Descuento  Comision   Horario
0    Maria   3000        0.1      0.01  Nocturno
1      NaN   6000        NaN       NaN       NaN
2      NaN   7000        NaN       NaN       NaN

In [137]:
df.skew()  # Asimetría

Venta        0.575042
Descuento    1.029948
Comision     1.031232
dtype: float64

In [138]:
df.kurt() # Curtosis

Venta        0.468744
Descuento    0.212774
Comision     0.322184
dtype: float64

Obtención de medidas por agrupación

In [139]:
df.groupby("Vendedor").mean() ## Calculo de la media

                Venta  Descuento  Comision
Vendedor
Jose      3500.000000   0.400000  0.025000
Juana     5666.666667   0.133333  0.016667
María     5400.000000   0.380000  0.022000

Obtención de medidas por agrupación de varias variables.

In [140]:
df.groupby(["Vendedor","Horario"]).std() ##Calculo de la desviación estándar

                         Venta  Descuento  Comision
Vendedor Horario
Jose     Nocturno  2121.320344   0.282843  0.021213
Juana    Diurno            NaN        NaN       NaN
         Nocturno  2121.320344   0.070711  0.000000
María    Diurno    4949.747468   0.070711  0.014142
         Nocturno  1527.525232   0.351188  0.000000

Cálculo de dos medidas estadísticas

In [141]:
df.groupby(["Vendedor",'Horario']).agg(['mean', 'std'])

                         Venta              Descuento           Comision  \
                          mean          std      mean       std     mean
Vendedor Horario
Jose     Nocturno  3500.000000  2121.320344  0.400000  0.282843    0.025
Juana    Diurno    6000.000000          NaN  0.100000       NaN    0.010
         Nocturno  5500.000000  2121.320344  0.150000  0.070711    0.020
María    Diurno    6500.000000  4949.747468  0.250000  0.070711    0.040
         Nocturno  4666.666667  1527.525232  0.466667  0.351188    0.010


                        std
Vendedor Horario
Jose     Nocturno  0.021213
Juana    Diurno         NaN
         Nocturno  0.000000
María    Diurno    0.014142
         Nocturno  0.000000

In [ ]:
Correlación

In [178]:
df.corr()

              Venta  Descuento  Comision
Venta      1.000000   0.015492 -0.324910
Descuento  0.015492   1.000000 -0.029693
Comision  -0.324910  -0.029693  1.000000

### Variables cualitativas

El commando describe presenta la cantidad de datos de la variable, la cantidad de valores distintos, la moda y la frecuencia.

In [97]:
df["Vendedor"].describe()

count        12
unique        3
top       María
freq          5
Name: Vendedor, dtype: object

### Frecuencias absolutas

Cantidad de individuos que poseen la característica.

In [198]:
pd.value_counts(df["Vendedor"])

María    5
Juana    3
Jose     2
Name: Vendedor, dtype: int64

### Frecuencias relativas

Porcentaje de individuos que poseen la característica

In [199]:
df["Vendedor"].value_counts() / len(df["Vendedor"])

María    0.5
Juana    0.3
Jose     0.2
Name: Vendedor, dtype: float64

### Tablas de Contingencia

#### Frecuencias absolutas

Cantidad de individuos que toman valores en dos variables 
distintas.

In [14]:
pd.crosstab(index=df["Vendedor"],
            columns=df["Horario"], margins=True)

Horario   Diurno  Nocturno  All
Vendedor
Jose           1         1    2
Juana          1         2    3
Maria          2         2    4
María          0         1    1
All            4         6   10

#### Frecuencias relativas

Porcentaje de individuos que toman valores en dos variables distintas.

In [205]:
pd.crosstab(index=df["Vendedor"], columns=df["Horario"],
            margins=True).apply(lambda r: r/len(df),
                                axis=1)

Horario   Diurno  Nocturno  All
Vendedor
Jose         0.1       0.1  0.2
Juana        0.1       0.2  0.3
María        0.2       0.3  0.5
All          0.4       0.6  1.0

#### Frecuencias relativas por vendedor

Porcentaje de veces que un vendedor estuvo en determinado horario.

In [208]:
pd.crosstab(index=df["Vendedor"], columns=df["Horario"]
           ).apply(lambda r: r/r.sum(),
                                axis=1)

Horario     Diurno  Nocturno
Vendedor
Jose      0.500000  0.500000
Juana     0.333333  0.666667
María     0.400000  0.600000

#### Frecuencias relativas por horario

Porcentaje de veces que en un horario estuvo un vendedor.

In [222]:
pd.crosstab(index=df["Vendedor"], columns=df["Horario"]
           ).apply(lambda r: r/r.sum(),
                                axis=0)

Horario   Diurno  Nocturno
Vendedor
Jose        0.25  0.285714
Juana       0.25  0.285714
María       0.50  0.428571

## Series de tiempo

Una serie de tiempo es un conjunto de variables aleatorias indexadas por el tiempo.

## Datos a analizar

Se importan los datos del archivo de excel de la hoja llamada Consolidado. Este archivo contiene información de la tasa representativa del mércado (TRM), del precio del barril de petróleo (WTI) y de la inflación.

In [320]:
Datos=pd.read_excel("DolarPetroleo.xlsx", sheetname="Consolidado") ## Importar datos
list(Datos) ## Conocer los nombres de las variables

['Fecha', 'Promedio de WTI', 'Promedio de Dólar', 'Inflación']

In [321]:
type(Datos)  ### Analizar el tipo de objeto que es Datos

pandas.core.frame.DataFrame

Se importa el paquete que maneja fechas

In [322]:
from datetime import datetime  ### Paquete que maneja fechas

Se definen las fechas con el $comando pd.date_range$ con el que se define la fecha de inicio, la fecha final y la periodicidad. En este caso es M de meses.

In [323]:
date_rng = pd.date_range(start='2015/01/01', end='2016/11/01', freq='M')
date_rng

DatetimeIndex(['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30',
               '2015-05-31', '2015-06-30', '2015-07-31', '2015-08-31',
               '2015-09-30', '2015-10-31', '2015-11-30', '2015-12-31',
               '2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30',
               '2016-05-31', '2016-06-30', '2016-07-31', '2016-08-31',
               '2016-09-30', '2016-10-31'],
              dtype='datetime64[ns]', freq='M')

Convertir los datos a una serie de tiempo

In [324]:
ts = pd.DataFrame(date_rng, columns=['date']) ## Se define el vector de fechas
Datos["ts"]= ts                  ## Se agregan al dataframe
Datos

        Fecha  Promedio de WTI  Promedio de Dólar  Inflación         ts
0  2015-01-01        47.759500        2398.827500   0.003600 2015-01-31
1  2015-02-01        58.095500        2420.384000   0.010907 2015-02-28
2  2015-03-01        55.885455        2586.630000   0.004159 2015-03-31
3  2015-04-01        59.524286        2499.223333   0.003626 2015-04-30
4  2015-05-01        64.075000        2432.650500   0.004299 2015-05-31
5  2015-06-01        61.477727        2558.571364   0.004087 2015-06-30
6  2015-07-01        56.561304        2732.771739   0.001815 2015-07-31
7  2015-08-01        46.515000        3013.991500   0.003432 2015-08-31
8  2015-09-01        47.623182        3073.115455   0.005350 2015-09-30
9  2015-10-01        48.430000        2934.117727   0.003918 2015-10-31
10 2015-11-01        44.267619        2995.609524   0.003893 2015-11-30
11 2015-12-01        38.005455        3246.438182   0.003872 2015-12-31
12 2016-01-01        30.875263        3282.683158   0.006138 2016-01-31
13 2016-02-01        32.181500        3354.887500   0.011443 2016-02-29
14 2016-03-01        38.210455        3137.715455   0.005692 2016-03-31
15 2016-04-01        41.583333        2998.712857   0.005302 2016-04-30
16 2016-05-01        46.742381        2987.488095   0.004292 2016-05-31
17 2016-06-01        48.247273        2992.864545   0.005202 2016-06-30
18 2016-07-01        44.951905        2960.058571   0.001978 2016-07-31
19 2016-08-01        45.843043        2961.422174   0.002300 2016-08-31
20 2016-09-01        46.567727        2921.145455   0.002932 2016-09-30
21 2016-10-01        49.522381        2931.800476   0.000877 2016-10-31

In [325]:
Datos = Datos.set_index('ts')  ## se define la variable ts como el indice del tiempo
Datos

                Fecha  Promedio de WTI  Promedio de Dólar  Inflación
ts
2015-01-31 2015-01-01        47.759500        2398.827500   0.003600
2015-02-28 2015-02-01        58.095500        2420.384000   0.010907
2015-03-31 2015-03-01        55.885455        2586.630000   0.004159
2015-04-30 2015-04-01        59.524286        2499.223333   0.003626
2015-05-31 2015-05-01        64.075000        2432.650500   0.004299
2015-06-30 2015-06-01        61.477727        2558.571364   0.004087
2015-07-31 2015-07-01        56.561304        2732.771739   0.001815
2015-08-31 2015-08-01        46.515000        3013.991500   0.003432
2015-09-30 2015-09-01        47.623182        3073.115455   0.005350
2015-10-31 2015-10-01        48.430000        2934.117727   0.003918
2015-11-30 2015-11-01        44.267619        2995.609524   0.003893
2015-12-31 2015-12-01        38.005455        3246.438182   0.003872
2016-01-31 2016-01-01        30.875263        3282.683158   0.006138
2016-02-29 2016-02-01        32.181500        3354.887500   0.011443
2016-03-31 2016-03-01        38.210455        3137.715455   0.005692
2016-04-30 2016-04-01        41.583333        2998.712857   0.005302
2016-05-31 2016-05-01        46.742381        2987.488095   0.004292
2016-06-30 2016-06-01        48.247273        2992.864545   0.005202
2016-07-31 2016-07-01        44.951905        2960.058571   0.001978
2016-08-31 2016-08-01        45.843043        2961.422174   0.002300
2016-09-30 2016-09-01        46.567727        2921.145455   0.002932
2016-10-31 2016-10-01        49.522381        2931.800476   0.000877

In [326]:
type(Datos["Promedio de WTI"])

pandas.core.series.Series

In [327]:
Datos.describe()

       Promedio de WTI  Promedio de Dólar  Inflación
count        22.000000          22.000000  22.000000
mean         47.861149        2882.777687   0.004505
std           8.801224         285.730701   0.002520
min          30.875263        2398.827500   0.000877
25%          44.438690        2623.165435   0.003474
50%          47.182781        2960.740373   0.004003
75%          54.294686        3010.171839   0.005277
max          64.075000        3354.887500   0.011443

Traer los datos de un día en específico

In [342]:
print(Datos["Promedio de WTI"]["2015/10/31"],";",
Datos["Promedio de Dólar"]["2015/10/31"],";",
Datos["Inflación"]["2015/10/31"])

48.43 ; 2934.1177272727273 ; 0.003918372400132058

Traer los datos de un rango

In [346]:
print(Datos["Promedio de WTI"]["2015-11-30":"2016-03-31"],";",
Datos["Promedio de Dólar"]["2015-11-30":"2016-03-31"],";",
Datos["Inflación"]["2015-11-30":"2016-03-31"])

ts
2015-11-30    44.267619
2015-12-31    38.005455
2016-01-31    30.875263
2016-02-29    32.181500
2016-03-31    38.210455
Name: Promedio de WTI, dtype: float64 ; ts
2015-11-30    2995.609524
2015-12-31    3246.438182
2016-01-31    3282.683158
2016-02-29    3354.887500
2016-03-31    3137.715455
Name: Promedio de Dólar, dtype: float64 ; ts
2015-11-30    0.003893
2015-12-31    0.003872
2016-01-31    0.006138
2016-02-29    0.011443
2016-03-31    0.005692
Name: Inflación, dtype: float64